'''
請設計一個程式，讓使用者輸入數值，只有加總偶數值，不加總正奇數值，如果輸入負數，結束程式。

顯示:========================================
請輸入第1個數值:456
請輸入第2個數值:455
請輸入第3個數值:123
請輸入第4個數值:-1
所有輸入的正偶數的加總是:xxxxxxx
=============================================
'''

num = 0
total = 0
while(True):
    number = int(input("請輸入數值:"))
    num += 1
    print(f"請輸入第{num}個數值:{number}")
    if number < 0:
        break
    elif number % 2 == 0:
        total += number
    elif number % 2 == 1:
        total += 0    
    print(f"所有輸入的正偶數的加總是:{total}")

print("程式結束")